IronicDeGawd/EthOnline2026-Amulet/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 8MB flash: the stock singleapp_large table is sized for a 2MB chip and its 0x177000 app
# partition overflows once LVGL is linked. See firmware/partitions.csv — nvs keeps its stock
# offset so the Ledger pairing bond survives the change.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
# Peripheral role + GATT server must stay on: NimBLE routes incoming notifications
# through the ATT server dispatch table. Central-only builds silently drop them.
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_GATT_SERVER=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256
CONFIG_ESP_TLS_INSECURE=n
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_WS_TRANSPORT=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=20480
CONFIG_ESP_TIMER_TASK_STACK_SIZE=4096
CONFIG_FREERTOS_HZ=1000

# Larger fonts: the round panel's active area is only ~32.5mm, so LVGL's 14px default is
# unreadable at arm's length. 20 for body, 28 for headings.
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y

# TLS sessions for the RPC and the brain link allocate ~40 KB each; internal RAM is full with
# WiFi + BLE + LVGL, so mbedtls takes its buffers from PSRAM.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# --- internal RAM budget -------------------------------------------------------------------
# Measured 2026-09-11: internal free dipped to 11 KB with three agents on ENS. WiFi, TLS, BLE
# and the screen's draw buffer all need internal RAM and nothing else can use it, so the fix is
# to move everything that does not have to be there somewhere else.
# Tried and reverted 2026-09-11: Bluetooth's pools in external RAM, and WiFi/lwIP buffers in
# external RAM, both crashed inside the network receive path with a spinlock assert. Code that
# runs with the cache disabled cannot touch external RAM, and those paths do. Left here so the
# next person does not spend the same hour finding out.
# CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL is not set
# TLS record buffers are allocated only while a connection is actually open, instead of being
# held for the life of the process. Two 16 KB buffers per connection is the single largest
# consumer we control.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_PEER_CERT=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
# CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP is not set
